{
  "aboutUs": {
    "paragraph1": "We built Hindsyght because working on projects, whether strategic or tactical, should be exciting and rewarding, not complicated. Our platform connects you and professional services companies of all sizes so you can find a partner that best fits your needs.",
    "paragraph2": "It’s simple: we listed as many IT professional services companies in your area as you specified. Whether you need services at your corporate headquarters or at a branch location across the country, there will be some local IT services providers that you can count on.",
    "paragraph3": "Regardless of the size of your project, you can find companies that will be delighted to provide you with great services. Since there is a chance that there are multiple companies nearby your office, you will have the opportunity to select the one that fits you the most. We love to see you and your local professional services providers get together to drive your business forward."
  },
  "founder": "<p>A project success-obsessed serial entrepreneur, Paul previously founded and was CEO of Unisap, Inc. (rebranded as Aptelis in 2012), a privately held professional services firm. The company was highly regarded in the SAP consulting industry based on its excellent performance record of implementations for over a decade.</p><p>Three years after Aptelis was acquired, Paul wanted to provide a way for Companies and Firms to connect and, improve the success rate of IT projects, he started Hindsyght. Paul graduated from Pepperdine University with a degree in Management. He is a dedicated leader whose mantra for every partner is \"Listen. Learn. Execute.\"</p><p>In his time away from work, Paul enjoys spending as much time as he could with his family and their two dogs.</p>",
  "team": {
    "GM": "<p>Greg heads up Finance and Operations at Hindsyght, where he is responsible for driving growth and efficiency across all capabilities and clients. He has earned a reputation in the industry for his ability to tackle complex challenges with an exceptionally high standard of integrity, and in close partnership with his teammates and clients. Greg joined Hindsyght from a global hi-tech company, Conexant, with multiple offices across the world. He was responsible for developing and scaling the company across multiple departments through client contracts / contractual compliance, purchasing, reporting, project management, production, and IT.</p><p>Greg lives in South Orange County with his wife, three kids and his beloved dog. He is very much enjoying his Tesla on a daily basis. “It’s the family thing”. That is his response when ask about his Tesla.</p>",
    "JL": "<p>Jamie leads Hindsyght’s product innovation and strategy. Jamie plays a key role in this area across the business. Prior to joining Hindsyght, Jamie co-founded the North American subsidiary of Hacknowledge, a cybersecurity company that focuses on network security monitoring. He has also served as CIO at ITT Cannon, a division of ITT Corp., a global manufacturing company that produces specialty components for the electronics and defense industry. Jamie holds an MBA from the Marshall School of Business at USC.</p><p>Outside of work, Jamie enjoys playing golf, basketball, and football.  Having an older home, his other weekend activities include fixing things around the house.  However, he often made things worse and had to hire someone to fix the mess he left behind.  Handyman of the year!!!</p>",
    "TL": "<p>Tuan is the head of Technology at Hindsyght, where he leads the engineering team and oversees the company’s online platform development. Tuan has been in web development throughout his career, helping several Fortune 500 companies to develop solutions for their businesses. Prior to joining Hindsyght, Tuan was an Executive Director at Sony, overseeing the development and operations support of the enterprise content management and data loss prevention programs. He began his IT career in the enterprise start up space, and was a founder of Vina Cloud Solutions LLC, an AWS-focused company.</p><p>Tuan is obsessed with his photography hobby. This is his weekend thing, taking his family on road trips and taking pictures in many different local locations.</p>",
    "LT": "<p>Lynn is in charge of Hindsyght’s Sales & Marketing and is responsible for building the company’s partnerships with leading brands. Lynn’s 20+ years of experience in business development, marketing, and ERP consulting makes her a trusted advisor with a holistic business perspective. Her understanding of how to leverage marketing to benefit brands’ business goals helps elevate Hindsyght’s value to both buyers and sellers. Lynn graduated from the UCI Paul Merage School of Business with an MBA degree.</p><p>When Lynn is not in her working mode, most likely you can find her in the garden or busy baking in her kitchen. Oh! forgot a few things…. Lynn loves biking, hiking, swimming, dancing, and singing.  Although her singing is not bad, sometimes it irritates her husband and the two Pomeranians.</p>"
  }
}