{
  "general": {
    "question1": "What is the Search Algorithm?",
    "answer1": "Our custom search algorithm is designed to help you find companies that match your needs.  Our unique system of proficiencies allows companies to specify their specializations to more easily match.  Our focus on local first, helps you find firms close to you saving on travel costs so you can find firms in your area.",
    "question2": "Some companies I expect to appear do not show up.",
    "answer2": "Our goal is to connect businesses to professional services companies in their area.  Therefore, our search algorithm will search for companies that fit the skillsets or proficiencies that you are looking for within 150 miles radius of where you are or the location that you entered at time of search.  If the company you are expecting to appear is outside of that radius, it will not be displayed.  In some instances, we will expand our search beyond 150 miles if the search criteria you enter does not return results from local companies.  Note, you can search by name to find that company that you are looking for.",
    "question3": "How do I share the company profile information with my friends and colleagues?",
    "answer3": "Once you are at the company profile page, you can click on Share at the top right corner of the company banner.",
    "question4": "How do I change my user profile data?",
    "answer4": "Go to My Account and select edit profile to change your profile data.",
    "question5": "How do I save or bookmark a company that I would like to review later?",
    "answer5": "You can use the Bookmark feature to save and keep track of great companies on Hindsyght so you can easily find them again later.  Simply find the business page that you would like to save and click “Bookmark” at the top of the business page.  Your bookmarks are stored in the Bookmark section of your account profile page and you’ll need to be logged in to your Hindsyght user account to use the feature.",
    "question6": "How do I remove a bookmark?",
    "answer6": "From your account profile page, click on Bookmarks.  You will find a set of companies that you have saved.  Click on the checkbox in front of the bookmarks and click on Delete.",
    "question7": "How do I write a review?",
    "answer7": "Search for a company you would like to write a review for.  Once you pull up the company profile, click on Write a review by the name of the company on the left side of the page.  A review and rating screen will appear.  After you are done, click save.  Please note that you can also click on “Write a Review” at the menu bar on top of the page.  It will take you to a search company page first so you can pull up the company you would like to write a review for.",
    "question8": "The company I want to write a review for is not in your database.",
    "answer8": "You can add the company, then write your review.  There are 2 ways to do it.  1) From the search result page, there is an “Add Company” button on the right side of the page.  If you can’t find your company, simply click on that button to add a company.  2) Click on “Add Company” at the menu bar on top of the page.  It will first bring you to a search page as we do not want to add a company if one already exists.  Follow step 1 to add your company.  Please note that there is a checkbox for the owner to claim the company, do not check on that box if you are not a representative and simply want to write a review.  Once the company information is added, you can write a review for it.",
    "question9": "How do I edit my reviews?",
    "answer9": "Go to My Account and click on Reviews tab.  There, you can select the review you would like to change by clicking edit and make the changes as required.  Click save after you are done.",
    "question10": "How do I delete my reviews?",
    "answer10": "We would like this site to be as authentic as possible and urge against deleting your reviews.  However, we do allow users who must delete a review 2 weeks from the date the review was entered to delete.",
    "question11": "How do I change the email address I used to log into my account?",
    "answer11": "Go to My Account and edit your email in your account profile data section.  If you logged in using LinkedIn, the email you use from LinkedIn is stored.  We suggest that you don’t change that email if you signed up through LinkedIn.",
    "question12": "How do I change a password for my user account?",
    "answer12": "Go to My Account and select Settings.  You will have the ability to change the password.",
    "question13": "I forgot my password.",
    "answer13": "Go to the login screen and click on Forgot Password to reset your password.  Note, that if you log in using your LinkedIn profile, we do not store your password.  Simply continue to log in using your LinkedIn profile ID and password.",
    "question14": "How do I report a review?",
    "answer14": "Get to the review you want to report in the Company Profile page and click the “Flag icon”.  You will be asked for a reason you are reporting the review.",
    "question15": "How do I sign up?",
    "answer15": "You can sign up using your LinkedIn profile, or with your email.  Click on Sign Up at the top right corner of the page and select the signup option you want."
  },
  "professional": {
    "question1": "How do I claim my company?",
    "answer1": "Search for your company and go to the company profile page.  If it has not been claimed, there should be a claim button on the left side of the page.  Click on “Claim” and follow the process on the screen.",
    "question2": "How do I claim a company that has already been claimed?",
    "answer2": "Company can only be claimed by its employee.  If someone else had already claimed your company, we have a “Re-Claim” process where you can request to re-claim the company profile.  We will send the original claimant a request to Transfer the ownership to you.  You will also be given the email address of the claimant so you can contact him/her directly to expedite the process.",
    "question3": "My company is not in the database.",
    "answer3": "You can add your company.  There are 2 ways to do it.  1) From the search result page, there is an “Add Company” button on the right side of the page.  If you can’t find your company, simply click on that button to add a company.  2) Click on “Add Company” at the menu bar on top of the page.  It will first bring you to a search page as we do not want to add a company if one already exists.  Follow step 1 to add your company.",
    "question4": "Can I own more than one company profile?",
    "answer4": "Yes, you can own multiple company profiles using your single account.  However, for each company profile you would like to own, we need to associate your work email that is the same as the company domain (or website) for the company you are claiming.  You can go to My Account/Company to view all of the companies that you own.",
    "question5": "How do I add branches?",
    "answer5": "The best way to add your branches is to go to your main corporate company profile page.  If you are the profile owner, there should be an edit icon.  Go to the branch section and click on “Add Branch”.",
    "question6": "How do I link a branch to my main company profile if they are not linked?",
    "answer6": "Please contact our support team.",
    "question7": "What do I get with your different Subscription levels?",
    "answer7": "Please click <a href=#>here</a> to see our subscription details.",
    "question8": "Why do I need to define proficiencies?",
    "answer8": "Your proficiency is the key component we use for our search.  If someone searches for a particular skillset, we will search for every company that lists that skillset as a proficiency.  Please note that as you type in a proficiency, stored proficiencies will appear in auto-suggestion for you to select.  If your skillset is not listed, you may type it in as our system will store your skillset as a new proficiency.",
    "question9": "How do I subscribe?",
    "answer9": "Once you claim your company, you are given an option to subscribe with free subscription or pay subscription.  In order to complete the claim process, you must minimally subscribe to the free subscription.",
    "question10": "How do I change my business information?",
    "answer10": "Go to your company profile page.  If you are the owner, there is an edit icon that you can select.  Your editable profile page will appear.",
    "question11": "How do I unsubscribe?",
    "answer11": "We want to make sure that we maintain the most accurate information about your company.  Therefore, instead of unsubscribe, we offer a free subscription with very limited features.  If you are the owner of the company profile, go to My Account page and click on “Subscription”.  You have the option to select the Free Subscription instead of the Pay Subscription.  Note, that you must do this before your renewal date.",
    "question12": "How do I pay for my subscription?",
    "answer12": "We accept credit cards, debit cards, purchasing cards, and ACH.",
    "question13": "How do I advertise on Hindsyght?",
    "answer13": "Please contact our sales team at sales@hindsyght.com",
    "question14": "How do I customize my Ad placement",
    "answer14": "There are a few features that we offer.  1) Geographical location – you can customize the areas you want your ads to reach; 2) User Title – you can customize the type of users you would like to reach; 3) Custom Ad Text – Customize the messaging on your ad.",
    "question15": "Why does my credit card transaction fail?",
    "answer15": "Privacy is a priority at Hindsyght.  Instead of storing your credit card, we use a PCI compliant payment processor to manage the payment transactions.  If there is an issue with your payment transaction, please contact us at support@hindsyght.com",
    "question16": "How do I close a business?",
    "answer16": "In the event that your business is closed, please contact Hindsyght support at support@hindsyght.com",
    "question17": "How do I respond to a review for my business?",
    "answer17": "If you are the owner of the company profile or delegates for the company profile, you can click on the “Respond” button next to the review you would like to respond to.  Please respond as positively and professionally as you can since other users will be reading your response.  Note, you can only respond to a review once.",
    "question18": "Should I respond to a review of my business?",
    "answer18": "It depends.  If you are upset, we recommend that you try to resolve the issue through direct messaging first.  We don’t want you to respond with something that will reflect poorly on your company.  Ultimately, if you do respond, make sure that you do it in such a way that it would leave a positive impression of your company."
  }
}